Revit 2026 API

# IFCFileWrite Method

---

Writes content to a file of IFC format.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Write(
	IFCFileWriteOptions writeOptions
)
```
```vb
Public Sub Write (
	writeOptions As IFCFileWriteOptions
)
```
```cpp
public:
void Write(
	IFCFileWriteOptions^ writeOptions
)
```
```fsharp
member Write :
        writeOptions : IFCFileWriteOptions -> unit
```

#### Parameters

writeOptions IFCFileWriteOptions
     The IFC file write options.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCFile Class

Autodesk.Revit.DB.IFC Namespace